announcements/gmaps-announce.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>GMaps: A Google Maps Client For The Emacspeak Desktop</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="GMaps: A Google Maps Client For The Emacspeak Desktop"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-28 Thu"/>
<meta name="author" content="T.V Raman"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">GMaps: A Google Maps Client For The Emacspeak Desktop</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> GMaps: A Google Maps Client For The Emacspeak Desktop</h2>
<div class="outline-text-2" id="text-1">


<p>
<a href="http://maps.google.com">Google Maps</a> provides a powerful service-oriented <a href="https://developers.google.com/maps/documentation/directions/">Directions API</a>
and an experimental <a href="https://developers.google.com/places/documentation/">Places API</a>. module <a href="http://emacspeak.googlecode.com/svn/trunk/lisp/g-client/gmaps.el">GMaps</a> (part of
g-client) implements a new specialized interaction mode that lets
you quickly get directions and perform Map searches.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Module GMaps is now in the Emacspeak svn repository and will be
part of the next Emacspeak release.   If you are running from
SVN, you can start using GMaps today after updating; make sure
to 
</p><pre class="example">
make config; make 
</pre>

<p>before trying to use it.
</p>

</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Usage:</h4>
<div class="outline-text-4" id="text-1-1-1">


<p>
Run command M-x gmaps to bring up the maps interaction buffer.
This buffer provides many special commands for talking to Google
Maps &ndash;  use <span style="text-decoration:underline;">C-h b</span> in emacs to get a list of
key-bindings. Here is a brief summary of how things work:
</p>
<ul>
<li>You can get directions (walking, driving, by cycling, or
    public transit)  via keystrokes <span style="text-decoration:underline;">w</span>, <span style="text-decoration:underline;">d</span>, <span style="text-decoration:underline;">b</span>, or <span style="text-decoration:underline;">t</span>. These
    commands prompt for start and end addresses.
</li>
<li>You can set your current location  by hitting <span style="text-decoration:underline;">c</span> &mdash; this
    will be used for Places Search.
</li>
<li>You can specify the radius for Places Search by pressing <span style="text-decoration:underline;">r</span>
    and specifying the radius  e.g. <i>500</i> for 500m.
</li>
<li>You can set up an optional  filter for your Places Search by pressing <span style="text-decoration:underline;">f</span>.
</li>
<li>Pressing <span style="text-decoration:underline;">n</span> at this point will show you places in your
    vicinity that match your filter criteria.
</li>
<li>Pressing 'space' on a Place displays details for that place.
</li>
<li>Place details when expanded provide buttons that link you to
    hours-of-business, Web-site for that place, and the place's
    G+ page if any.
</li>
</ul>


<p>
Note that module GMaps replaces the now obsolete Emapspeak
functionality that has been available on <span style="text-decoration:underline;">C-e?e</span> since
early 2005.
</p>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-28 Thu</p>
<p class="author">Author: T.V Raman</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3d with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
